---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralBendDirAngle
source: html/ab6cb328-2a4a-bcc1-c2c0-4810cffb34e5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralBendDirAngle Property

"Cross-Section Rotation"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralBendDirAngle { get; }
```